{
  "DecisionMaking": {
    "Low": {
      "label": "پویایی تصمیم‌گیری - سطح پایین",
      "analysis": "در شرایط فشار، تصمیم‌گیری تو بیشتر واکنشی است تا تحلیلی. ذهن تو بین «باید سریع عمل کنم» و «نمی‌دونم چی درسته» در نوسانه. یعنی در لحظه بحرانی، هیجان گاهی فرمانده تو می‌شه.",
      "growth_hint": "تو خیلی سریع واکنش نشون می‌دی. اگر این سرعت رو ببری داخل یک چارچوب مشخص، تبدیل می‌شه به مهارت «تصمیم‌گیری غریزیِ هوشمند»."
    },
    "Medium": {
      "label": "پویایی تصمیم‌گیری - سطح متوسط",
      "analysis": "سیستم تحلیلی فعالی داری، اما گاهی سرعت و تردید با هم درگیر می‌شن. فرصت رو می‌بینی ولی در لحظه اجرا ممکنه مکث طولانی یا بیش‌تحلیل باعث تأخیر بشه.",
      "growth_hint": "کلید رشد تو «تصمیم‌گیری در زمان محدود»ه. باید بتونی در شرایط نیمه‌مطمئن هم تصمیم بگیری، نه فقط وقتی همه‌چیز عالیه."
    },
    "High": {
      "label": "پویایی تصمیم‌گیری - سطح بالا",
      "analysis": "در فشار بالا شفاف، منظم و سریع تصمیم می‌گیری. احساسات رو می‌بینی ولی نمی‌ذاری کنترلت رو بگیرن. مسئولیت تصمیم رو هم می‌پذیری.",
      "growth_hint": "این سطح خیلی باارزشه. فقط مراقب باش از بازبینی و گرفتن فیدبک واقعی دور نشی و مطمئن بمونی که اعتمادبه‌نفس جای لجاجت رو نگیره."
    }
  },
  "RiskReward": {
    "Low": {
      "label": "ادراک ریسک و سود - سطح پایین",
      "analysis": "برداشتت از ریسک نوسان زیادی داره: یا خیلی می‌ترسی، یا بی‌محابا عمل می‌کنی. گاهی طمع برای سود سریع یا ترس از ضرر باعث می‌شه از پلن جدا بشی.",
      "growth_hint": "نیاز داری ریسک رو به زبان عدد و سناریو تعریف کنی، نه صرفاً حس. وقتی ریسک شفاف و قابل‌محاسبه باشه، ترس و هیجان هر دو آروم‌تر می‌شن."
    },
    "Medium": {
      "label": "ادراک ریسک و سود - سطح متوسط",
      "analysis": "می‌دونی ریسک بخشی از بازیه و ازش فرار نمی‌کنی، اما هنوز احساس می‌تونه ترازو رو جابه‌جا کنه. بعضی تصمیم‌ها خیلی حساب‌شده‌ان، بعضی‌ها احساسی.",
      "growth_hint": "قدم بعدی تو ثباته: اینکه قبل هر ورود، نسبت ریسک/سود رو مکتوب کنی و فقط ستاپ‌هایی رو بازی کنی که معیار دارن."
    },
    "High": {
      "label": "ادراک ریسک و سود - سطح بالا",
      "analysis": "ریسک برات یک ابزار محاسباتیه، نه تهدید و نه هیجان. قبل از وارد شدن می‌سنجی آیا این ریسک قابل پرداخت هست و آیا پاداشش ارزشش رو داره.",
      "growth_hint": "گاهی این سطح از احتیاط می‌تونه باعث بیش‌ازحد امن بازی کردن بشه. مراقب باش به خاطر محافظه‌کاری فرصت‌های رشد معقول رو کنار نذاری."
    }
  },
  "CognitiveEmotional": {
    "Low": {
      "label": "هماهنگی شناخت و هیجان - سطح پایین",
      "analysis": "هیجان (ترس، خشم، طمع...) بعضی وقت‌ها کنترل تصمیم رو در لحظه می‌گیره و منطق عقب می‌ره. بعدش معمولاً می‌فهمی «می‌دونستم نباید این کارو بکنم».",
      "growth_hint": "این یعنی آگاهی اولیه وجود داره. تو می‌تونی یاد بگیری قبل از عمل، احساس رو ببینی و اسم‌گذاریش کنی تا شدت اثرش کم بشه."
    },
    "Medium": {
      "label": "هماهنگی شناخت و هیجان - سطح متوسط",
      "analysis": "احساس رو می‌شناسی، گاهی مدیریت می‌کنی و گاهی هنوز احساس جلو می‌زنه. بعد از معامله معمولاً دقیق می‌فهمی چرا اون تصمیم رو گرفتی.",
      "growth_hint": "تو در نقطه طلایی خودآگاهی هستی. با تمرین توقف آگاهانه وسط بازار (مکث قبل از تصمیم) می‌تونی بپری به سطح حرفه‌ای."
    },
    "High": {
      "label": "هماهنگی شناخت و هیجان - سطح بالا",
      "analysis": "می‌تونی حضور احساس رو بپذیری و در عین حال منطق رو نگه داری. هیجان برای تو سیگنال اطلاعاتیه، نه راننده تصمیم.",
      "growth_hint": "فقط حواست باشه کنترل رو با سرکوب قاطی نکنی. سرکوب بلندمدتِ احساس می‌تونه خستگی روانی و افت انگیزه بیاره."
    }
  },
  "GrowthMindset": {
    "Low": {
      "label": "ذهنیت رشد و بهبود مستمر - سطح پایین",
      "analysis": "اشتباه برایت تهدید عزت‌نفسه. باخت رو برابر می‌دونی با «من بد هستم». به همین خاطر از بازبینی اشتباه فرار می‌کنی.",
      "growth_hint": "اگر شکست رو به‌عنوان اطلاعات دیدن رو تمرین کنی، سرعت رشدت چند برابر می‌شه. شکست = داده، نه قضاوت شخصیت."
    },
    "Medium": {
      "label": "ذهنیت رشد و بهبود مستمر - سطح متوسط",
      "analysis": "باور داری می‌تونی بهتر بشی و معمولاً هم تلاش می‌کنی، ولی استمرار تمرین و بازبینی همیشه ثابت نیست. بعضی روزها کاملاً حرفه‌ای، بعضی روزها فرار.",
      "growth_hint": "گام بعدی تو ثبات رفتاریه. حتی تمرین کوچک اما ثابت بهتر از انفجار انگیزه موقتیه."
    },
    "High": {
      "label": "ذهنیت رشد و بهبود مستمر - سطح بالا",
      "analysis": "یادگیری برایت یک عادت روزانه‌ست. اشتباه رو به چشم ورودی اطلاعات نگاه می‌کنی و دنبال اصلاح می‌ری، نه دفاع.",
      "growth_hint": "فقط مواظب باش دائم تو حالت «بهبود» نمونی و استراحت ذهنی رو مقصر ندونی. بازی طولانی‌مدته."
    }
  }
}
